using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lab1V8
{
    internal class Program
    {
        //Варіант 8.
        //Розробити підсистему для відтворення ситуації на шаховій дошці.
        //Підсистема отримує список шахових фігур із координатами та повертає шахову дошку (двовимірний масив) із розставленими фігурами - об'єктами які містять вид фігури, колір, метод виводу шахової на дисплей).
        //Передбачити що існує декілька класів шахматних фігур, що відрізняються методами виводу.
        //Який саме клас необхідно використовувати визначається при запуску.



        //отримує список шахових фігур із координатами

        //повертає шахову дошку(двовимірний масив) із розставленими фігурами
        //об'єктами які містять вид фігури, колір, метод виводу шахової на дисплей
        static void Main(string[] args)
        {
        }
    }
}
