using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lab2
{
    internal class Program
    {
        //Прочитати вимоги.
        //Вказати структурний шаблон, який доцільно використати для розв'язування задачі.
        //Розробити програмний прототип, який імітує діяльність відповідної системи, наприклад, замість надсилання SMS повідомлення вивести текст повідомлення в консоль.
        //Провести демонстрацію роботи системи.

        //        Варіант 1. Дано покупка(Назва товару, Категорія, Виробник, Ціна, Опис, Час покупки, Спосіб оплати, Покупець).
        //        Розробити систему знижок яка розраховує кінцеву ціну товару для покупця враховуючи такі види знижок:
        //a.Персональна знижка покупця N відсотків
        //b.Знижка на покупку в нічний час X відсотків
        //c.Знижка У відсотків на категорію товарів.
        //d.Знижка Z відсотків при оплаті карткою.
        //Врахувати всі можливі комбінації знижки.

        static void Main(string[] args)
        {
        }
    }
}
